Revit 2027 API
RebarBarType.GetHookTangentLength Method
 Identifies the hook tangent length for a hook type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetHookTangentLength(
	ElementId hookId
)
Public Function GetHookTangentLength (
	hookId As ElementId
) As Double
public:
double GetHookTangentLength(
	ElementId^ hookId
)
member GetHookTangentLength :
        hookId : ElementId -> float
Parameters
hookId ElementId
 id of the hook type
Return Value
Double
 The hook tangent length for a hook type
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookId is not valid
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace